:PROPERTIES:
:ID:       535e0dbd-91b5-4678-bb31-e7a4e1e1b3c5
:END:
#+TITLE: Bash: Join on piped input
#+CATEGORY: slips
#+TAGS:

[[https://catonmat.net/set-operations-in-unix-shell][Set operations in the Unix Shell]] there's also a cheatsheet version, but this
article contains new examples.

#+name: astr1
#+begin_src emacs-lisp
"foo bar baz c d e"
#+end_src

#+name: astr2
#+begin_src emacs-lisp
"bar baz a b c d foo"
#+end_src

Cutting is necessary if values in columns you want to join on aren't well
formatted.

#+begin_src sh :var str1=astr1 str2=astr2
join <(echo $str1 | tr ' ' '\n' | sort) \
     <(echo $str2 | tr ' ' '\n' | sort)
#+end_src

#+RESULTS:
| bar |
| baz |
| c   |
| d   |
| foo |

it's pretty hard to find unix commands with the right output
formatting. which is why it's not all that useful.

#+begin_src sh
netstat -i | tail -n+2 > /tmp/nstat_ifx
#+end_src

These should just be streams that you can =cut=



* Roam
+[[id:cf847bc5-31f7-4bb8-8324-7680a8f2953d][Shell]]
